{

  "LOGIN_SCREEN_TITLE_TEXT_1":"Connect with your",
  "LOGIN_SCREEN_TITLE_TEXT_2":"social account or email",
  "CONTINUE_WITH_FACEBOOK":"CONTINUE WITH FACEBOOK",
  "CONTINUE_WITH_LINE":"CONTINUE WITH LINE",
  "LOGIN":"Login",
  "LOGIN_SCREEN_TERMS_TEXT_1":"By signing up you agree with our",
  "LOG_IN":"Log In",
  "CREATE_NEW_ACCOUNT":"Create New Account",
  "TOS":"Terms of Services ",
  "PRIVACY_POLICY":"Privacy Policy",
  "DONT_HAVE":"Don't have an account yet ?",
  "FIELDS_REQUIRED":"All information is required",
  "FIELDS_UPDATE_REQUIRED":"All fields are required for update. We do not share or display your email or phone number.",
  "FIRST":"First",
  "LAST_NAME":"Last",
  "CITY":"City",
  "COUNTRY":"Country",
  "STATE":"State",
  "PHONE":"Mobile Number",
  "PREFERRED_LANGUAGE":"Prefered written language",
  "PREFERRED_LANGUAGE_DESCRIPTION":"Your preferred language for chat",
  "EMAIL":"Email",
  "PASSWORD":"Password",
  "CONFIRM_PASSWORD":"Confirm Password",
  "UPLOAD_PICTURE_TEXT":"Upload a picture or select an avatar to show hotels and other users who you are.",
  "SELECT_AVATAR":"SELECT AVATAR",
  "UPLOAD_PICTURE":"UPLOAD PICTURE",
  "EMAIL_LOG_IN":"Email Log In",
  "CANCEL":"Cancel",
  "SEARCH":"Search ",
  "CITY_REGION":"City or Region",
  "ACTIVITY":"Activity",
  "EXPERIENCE_SHARE_BOOK":"EXPERIENCE, SHARE & BOOK",
  "HOTELS":"Hotels",
  "FLIGHTS":"Flights",
  "ACTIVITIES":"Activities",
  "SKIP":"Skip",

  "FORGOT_PASSWORD":"Forgot Password?",
  "FORGOT_PASSWORD_TEXT":"Please enter your email address and we'll get you back on track.",
  "SUBMIT":"Submit",

  "AVATAR_TITLE":"Select Your Avatar",
  "MALE_AVATAR":"Male Avatars",
  "FEMALE_AVATAR":"Female Avatars",
  "SELECT":"Select",
  "PROFILE":"Profile",
  "EDIT_PROFILE":"Edit Profile",
  "SIGN_OUT":"Sign Out",
  "MESSAGING":"Messaging",
  "LOGIN_ERROR":"Invalid Email or Password or Check Your Internet Connection",
  "NON_VERIFIED_USER_LOGIN_ERROR":"Please verify your email before logging in",
  "NO_INTERNET":"No Internet Connection",
  "SIGN_UP":"SIGN UP",
  "UPDATE_USER":"UPDATE",
  "PAIRED_TO" : "PAIRED TO",
  "PAIRING_CODE": "PAIRING CODE",
  "PAIR_YOUR_OWN_DEVICE": "PAIR YOUR OWN DEVICE",
  "PAIRING_INFORMATION":"PAIRING INFORMATION",
  "CURRENTLY_NOT_PAIRED":"Currently not paired",
  "LINKED_MESSAGING_ACCOUNTS": "LINKED MESSAGING ACCOUNTS",
  "BASIC_INFORMATION": "BASIC INFORMATION",
  "PULL_TO_REFRESH" : "Pull To Refresh",
  "VERIFIED" : "verified",
  "NOT_VERIFIED" : "unverified",
  "CONFIRM_CHECKOUT" : "Confirm Checkout",
  "CONFIRM_CHECKOUT_NAME_START": "The credit card on file for ",
  "CONFIRM_CHECKOUT_NAME_END": " will be charged,",
  "CONFIRM_CHECKOUT_SETTLE_OUT": "to settle out your room bill.",
  "CONFIRM_CHECKOUT_YOU_WILL": "You will be immediately\nchecked out of the room ",
  "CONFIRM": "Confirm",
  "ENJOY_YOUR_TRIP": "Enjoy Your Trip",
  "EXPRESS_CHECKOUT": "Express Checkout",
  "FOLIO_PLEASE_WAIT": "Please wait while\nwe retrieve your folio.",
  "DATE": "Date",
  "DESCRIPTION": "Description",
  "AMOUNT": "Amount",
  "ROOM": "Room",
  "TOTAL": "Total",
  "YES": "Yes",
  "NO_EXIT": "No Exit",
  "YOU_HAVE_SUCCESSFULLY_CHECKOUT": "You have successfully checked out.",
  "WOULD_YOU_LIKE_A_COPY": "Would you like a copy\nsent to your email ?",
  "EMAIL_IN_PROFILE": "email in profile:",
  "MESSAGE_FOOTER_ONE" : "Ask questions before or during your stay.",
  "MESSAGE_FOOTER_TWO" : "Need help with travel plans ask an",
  "MESSAGE_FOOTER_THREE" : "OKKAMI Concierge.",
  "MESSAGE_FOOTER" : "Ask questions before or during your stay. Need help with travel plans ask an OKKAMI Concierge.",
  "MESSAGE_CLICK" : "to search for partner hotels to message.",
  "CLICK" : "click",
  "MESSAGES" : "Messages",
  "PROFILE_CONFIRMATION" : "Profile Confirmation",
  "SEARCH_HOTEL":"Search By Hotel Name",
  "FILTER":"Filter",
  "HOTEL_PARTNERS" : "Hotel Partners",
  "HOTEL_PARTNERS_SORRY" : "We're sorry, there are no hotels that match your search criteria. Please modify your search criteria or remove your filters and search again.",
  "PAIR_TO_ROOM" : "Pair To Room",
  "PAIR_TEXT_1" : "Enter your mobile pairing code. If you",
  "PAIR_TEXT_2" : "have not received a code",
  "PAIR_TEXT_3" : "contact the frontdesk",
  "PAIR_CONNECT" : "CONNECT TO ROOM",
  "EXPLORE": "Explore",
  "MY_STAY": "My Stay",
  "TRIPS": "Trips",
  "BOOK_NOW": "Book Now",
  "FOLIO_PLEASE_CONNECT": "Please connect to a room.",
  "WE_HAVE_DETECTED": "we have detected your location\nare you currently nearby",
  "MORE": "More",
  "OKKAMI_CHAT_WELCOME" : "We'll be happy to assist you",
  "OKKAMI_CHAT_NEARBY" : "We've detected your nearby",
  "OKKAMI_CHAT_ASSIST" : "How may we assist you ?",
  "OKKAMI_CHAT_SELECT_TO_START" : "Select to start chatting now",
  "UPDATE_PROFILE" : "Update Profile",
  "AVAILABLE_CONCIERGE" : "Available Okkami Concierge",
  "OKKAMI_CONCIERGE_SUB": "Click to start group chat",
  "SEE_ALL" : "See All >>",
  "RECOMMENDED_HOTEL_PARTNERS" : "Recommended Hotel Partners",
  "BRAND_NAME" : "Okkami",
  "BOOK_TONIGHT" : "BOOK TONIGHT",
  "GUEST" : "Guest",
  "CONFIRM_DISCONNECT": "Confirm Disconnect",
  "DISCONNECT_CONFIRM" : "Your device will no longer be able to control in-room components.\nDisconnecting does not check you out of the room or delete your chats with the hotel.",
  "AT": " at ",
  "ARE_YOU_SURE": "Are you sure you would like to un-pair your device from room ",
  "NOT_PAIRED": "Not paired to any room. Nothing to disconnect",
  "PLEASE_CONFIRM_EMAIL": "Please Confirm Your Email First",
  "EXPLORE_DEALS": "Explore Deals",
  "LANGUAGE": "Language",
  "CHECKOUT": "Checkout",
  "DISCONNECT_FROM_ROOM": "Disconnect From Room",

  "RESENT_EMAIL" : "An email confirmation has been sent. Please check your email and sign in with your password.",
  "RESENT_EMAIL_ERROR" : "Email Confirmation Request Failed",
  "RESENT_EMAIL_TITLE" : "Resend Email",

  "TV_POWER":"Tv Power",
  "INPUT":"Input",
  "MENU":"Menu",
  "GUIDE":"Guide",
  "MOVIES":"Movies",
  "BACK":"Back",

  "VOLUME":"VOL",
  "CHANNEL":"CH",
  "CONTROLS":"Controls",
  "CHANNELS":"Channels",

  "LAST":"Last",

  "PASSWORD_ERROR":"Forgot Password Request Failed",


  "WHERE_ARE_YOU_GOING":"Where are you going?",
  "CHECK_IN":"Check in",
  "CHECK_OUT":"Check out",
  "ROOMS":"Rooms",
  "SEARCH_HOTELS":"Search Hotels",

  "LEAVING_FROM":"Leaving From",
  "GOING_TO":"Going To",
  "DEPARTING_DATE":"Departing Date",
  "RETURNING_DATE":"Returning Date",
  "PASSENGERS":"Passengers",
  "CLASS":"Class",
  "NON_STOP":"Non-stop Flights",
  "SEARCH_FLIGHTS":"Search Flights",

  "ECONOMY_CLASS":"Economy Class",
  "PREMIUM_CLASS":"Premium Class",
  "BUSINESS_CLASS":"Business Class",
  "FIRST_CLASS":"First Class",


  "SELECT_COUNTRY":"Select Country",
  "CITY_OR_REGIONS":"City or Region",
  "SEARCH_ACTIVITIES":"Search Activities",

  "PRICELINEFLIGHTFROM":"Flight from",
  "PRICELINEFLIGHTTO":"Flight To",

  "PROMO1_HEADER":"Upgrade Your Stay",
  "PROMO1_TEXT":"With OKKAMI You Can:\nPre-checkin\nRequest Room Upgrades\nChat With Hotel Staff",

  "PROMO2_HEADER":"OKKAMI Concierge",
  "PROMO2_TEXT":"Save time planning before &\nduring your trip. Get the\nbest advice from an\nexperienced local concierge\nwith common interest.",

  "PROMO3_HEADER":"Experience & Share",
  "PROMO3_TEXT":"Share & compare your travel\nexperiences. Build your\nultimate travel schedule\nwith help from locals &\nOKKAMI Concierge.",

  "EMAIL_SIGN_UP":"Email Sign up",
  "STATE_NOT_SELECTED":"State not selected",
  "SELECT_STATE":"You must select state first",

  "OK":"Ok",

  "PRICELINECITIES":"Select City",

  "OR":"Or",

  "WELCOME":"Welcome",

  "HOTEL":"Hotel",

  "CHECK_GPS_AND_PULL":"Make sure location service is turned on and pull to refresh",
  "SEE_RESULTS" : "SEE RESULTS",

  "COUNTRY_NOT_SELECTED":"Country not selected",
  "MUST_SELECT_COUNTRY":"You must select country first",


  "MUST_SELECT_STATE":"You must select state first",

  "DAYS":{
    "one": "1 Day",
    "other": "{{count}} Days",
    "zero": "0 Day"
  },
  "HOURS": {
    "one": "1 Hour",
    "other": "{{count}} Hours",
    "zero": "0 Hour"
  },
  "MINUTES": {
    "one": "1 Minute",
    "other": "{{count}} Minutes",
    "zero": "0 Minute"
  },
  "SECONDS": {
    "one": "1 Second",
    "other": "{{count}} Seconds",
    "zero": "0 Second"
  },
  "LESS_THAN_SECONDS": "Less than a second",


  "SIGN_UP_FAILED":"Sign Up Failed",
  "SIGN_UP_SUCCESS":"Sign Up Success",
  "PLEASE_CONFIRM_YOUR_EMAIL":"Please Confirm Your Email.",
  "UPDATE_USER_FAILED": "Update User Failed",
  "SUCCESS": "Success",
  "UPDATE_USER_SUCCESS": "Update User Success",
  "WE_ARE_SORRY_BUT_SOMETHING": "We’re sorry but something went wrong",
  "VERIFY_EMAIL": "Do you need to verify your email ?",
  "REQUEST_VERIFY": "Request verification",
  "SIGN_UP_WELCOME": "Welcome to ",

  "EXIT": "Exit",
  "EXIT_DETAIL": "Are you sure you want to exit this app",

  "SEARCH_HOTEL_PARTNERS":"Search Hotel Partners",
  "ALL_CHANNELS":"ALL CHANNELS",
  "MUTE": "Mute",
  "DIGITS": "Digits",

  "SEARCH_PARTHER_HOTELS": "Search partner hotels",
  "SEARCH_PARTHER_HOTELS_DETAIL": "When you stay at an OKKAMI partner hotel our app provides you with convenient features during your stay.",
  "SEARCH_PARTNER_HOTEL_POPUP": "SEARCH FOR PARTNER HOTELS BY NAME, COUNTRY OR REGION",
  "VIATORCOUNTRYSTATE":"Places",

  "WHAT_IS_YOUR_CURRENT_HOMETOWN": "What is your current hometown?",
  "WHAT_CONTACT_INFO": "We will use this email to verify your account.",
  "TERMS_OF_SERVICE_DETAIL": "Our Commitment to Privacy\nOkkami Inc., (“Okkami,” “we,” “us,” or “our”) believes that the responsible use of personal information is critical to the continued success of mobile commerce and the Internet. While you may access our apps on your mobile device (“App”) and most areas of our site(s) on the World Wide Web (“Site”) without submitting any personal data, there are certain areas of the App and/or Site that request specific personal information including but not limited to name, phone number, e-mail address and payment information. Our intent is to allow you as much control as possible over your personal information. This Privacy Policy explains how Okkami collects, stores, and uses your information. If you have objections to the Privacy Policy, you should not access or use the App and Site.  This Privacy Statement (“Statement”) Applies to persons anywhere in the world who use our Apps or services (“Services”) to request travel-related services (“Users”).\n\nData Protection Safe Harbor\nOkkami adheres to the \"safe harbor\" framework that resulted from the European Commission's Directive on Data Protection. For more information about safe harbor, please see the following website (not affiliated with Okkami): http://www.export.gov/safeharbor/. If you have any questions or concerns about Okkami's compliance with the safe harbor principles, please direct them to: info@Okkami.com.\n\nEntity Collecting Personal Information\nPersonal information on this Site is collected by Okkami Inc.\n\nWhat Information We Collect\nWe collect information you provide directly to us, such as when you create or modify your account, request on-demand services, contact customer support, or otherwise communicate with us. This information may include: name, email, phone number, postal address, profile picture, payment information, items requested (for delivery services), delivery notes, and other information you choose to provide.  Depending on the activity, some of the information that we ask you to provide is identified as mandatory and some as voluntary. If you do not provide the mandatory data with respect to a particular activity, you will not be able to engage in that activity.  Other types of activities during which we may collect information, including personal information in some cases, include:\nPayment and Credit Card Information\nIn order order to make facilitate payments between travelers and providers we collect (through a PCI-compliant third-party service) credit card and other payment information from travelers and payment collection information, such as bank account information from providers.\nGeo-Location Information\nWhen you use the Services, we may collect precise location data from the App. If you permit the App to access location services through the permission system used by your mobile operating system, we may also collect the precise location of your device when the App is running in the foreground or background. We may also derive your approximate location from your IP address.\nContacts Information\nIf you permit the Okkami App to access the address book on your device through the permission system used by your mobile platform, we may access and store names and contact information from your address book to facilitate social interactions through our Services and for other purposes described in this Statement or at the time of consent or collection.\nTransaction Information\nWe collect transaction details related to your use of our Services, including the type of service requested, date and time the service was provided, amount charged, distance traveled, and other related transaction details. Additionally, if someone uses your promo code, we may associate your name with that person.\nUsage and Preference Information\nWe collect information about how you and site users interact with our Services, preferences expressed, and settings chosen. In some cases we do this through the use of cookies, pixel tags, and similar technologies that create and maintain unique identifiers. To learn more about these technologies, please see our Cookie Statement, below.\nDevice Information\nWe may collect information about your mobile device, including, for example, the hardware model, operating system and version, software and file names and versions, preferred language, unique device identifier, advertising identifiers, serial number, device motion information, and mobile network information.\nTelecom Data\nOur Services facilitate communications between Users and providers. In connection with facilitating this service, we receive call data, including the date and time of the call or SMS message, the parties’ phone numbers, and the content of the SMS message.\nServer Logs\nOur Web server automatically recognizes the visitor's domain name, browser type, operating system, entry page, exit page, and average time on the Site. This information is used for internal purposes only in helping us improve our Site and better your overall experience.   Additionally, when you interact with the Services, we collect server logs, which may include information like device IP address, access dates and times, App features or pages viewed, App crashes and other system activity, type of browser, and the third-party site or service you were using before interacting with our Services.\nOnline Forms\nWe may use online forms in several areas of our Site. All information provided by the visitor is voluntary, but required to access certain Services, with information requested generally including name, address, company, and e-mail. We may sometimes use this information to contact users for marketing, sales, service and support purposes, as described below in the section titled “Use of Your Information.”\nFeedback\nAfter receiving Okkami Services, you may be prompted by the App to provide a rating and comments of the providers, which you will provide in good faith, and the providers may be prompted to provide a rating and comments of you.  Okkami reserve the right to use, share and display your and Providers ratings and comments in any manner in connection with the business of Okkami without attribution to you or your approval.  Additionally, the App and Site may have voluntary questionnaires designed to solicit other feedback. Users remain anonymous unless they choose to provide their name and e-mail address. Information is used to improve the Site, provide a more engaging and useful experience for Site users, and for sales and marketing purposes.\nContest and Promotions\nWhen you enter a contest or other promotional feature, we may ask for your name, mailing address, and e-mail address so that we can administer the contest and notify winners.\nTracking Data\nWhen used properly, cookies can improve the utility of a site by being able to securely store and Apply personal data that users have voluntarily shared with the site. \"Cookies\" are small pieces of information that are stored by your browser on your computer's hard drive. Unless you use our “Remember Me” functionality, our cookies do not contain any personal identification information but they do enable us to store site preferences, form information between visits, and items in your shopping cart. Most Web browsers automatically accept cookies, but you can change your browser settings to prevent such acceptance. Doing so, however, may result in disabling the functionality we have in place to better serve your needs.  Checking “Remember Me” before accessing certain features of the Site will enable you to access those features without having to type your User ID and password each time you visit. To do this, we store a cookie that contains your user ID and password. For this functionality to operate correctly, your Web browser must support cookies, and you must have them enabled. If this box is unchecked, the sign-in process will still work, however, your user ID and password will not be remembered by the Site. We do not recommend that users using shared computers use this feature, as it may impose a security risk to your account.\nOther Sources\nWe may also receive information from other sources and combine that with information we collect through our Services, including: if you choose to link, create, or log in to your Okkami account with a payment provider (e.g., Google Wallet) or social media service (e.g., Facebook), or if you engage with a separate App or website that uses our API (or whose API we use), we may receive information about you or your connections from that site or App; if your employer uses one of our enterprise solutions, such as Okkami for Business, we may receive information about you from your employer; when you request on demand services, our providers may provide us with a User rating after providing services to you; and if you also interact with our Services in another capacity, for instance as a provider or user of other Apps we provide, we may combine or associate that information with information we have collected from you in your capacity as a User or traveler.\n\nCookie Policy\nWe use cookies to personalize the experience of our users, provide support to customers, record visitor preferences, provide personalized and specialized content, record session information, track visitor click stream behavior throughout the Site, track items in your shopping cart and customize Site content based on your browser type, operating system, and preferences. For more detailed information about cookies, what they are, and why they are used, please visit the following website (not affiliated with Okkami): http://www.cookiecentral.com/faq/index.shtml.  In connection with cookies, we use Web beacons (transparent graphic images) to provide us with automated feedback on Site usage.\n\nUse of Your Information\nOkkami collects your information to record and support your participation in the activities you select, including:\nFacilitation\nProvide, maintain, and improve our Services, including, for example, to facilitate payments, send receipts, provide products and services you request (and send related information), develop new features, provide customer support to Users and providers, develop safety features, authenticate users, and send product updates and administrative messages.\nOperation\nPerform internal operations, including, for example, to prevent fraud and abuse of our Services; to troubleshoot software bugs and operational problems; to conduct data analysis, testing, and research; and to monitor and analyze usage and activity trends.\nCommunication\nSend or facilitate communications (i) between you and a provider, such as estimated times of arrival (ETAs), or (ii) between you and a contact of yours at your direction in connection with your use of certain features, such as referrals, invites, split fare requests, or ETA sharing.\nPromotion\nSend you communications we think will be of interest to you, including information about products, services, promotions, news, and events of Okkami and other companies, where permissible and according to local Applicable laws; and to process contest, sweepstake, or other promotion entries and fulfill any related awards.\nPersonalization\nPersonalize and improve the Services, including to provide or recommend features, content, social connections, referrals, and advertisements.\n",
  "TERMS_OF_SERVICE_DETAIL_2": "E-mail Addresses\nWe do not collect e-mail addresses without you voluntarily providing us with this information.  We will periodically use your e-mail information for service, sales, support, and marketing purposes. If you do not wish to receive e-mail from us in the future, please read Your Choices below. From time to time, we may share your e-mail address with other organizations and companies whose products or services we think you may find interesting. If you would like to be included in our \"do not share\" list, please see Your Choices.\nPostal Addresses\nWe do not collect postal addresses without you voluntarily providing us with this information. We will periodically use your postal address information for service, sales, support, and marketing purposes. If you do not wish to receive postal mailings from us in the future, please read Your Choices below. From time to time, we share your postal address with other organizations and companies whose products or services we think you may find interesting. If you would like to be included in our \"do not share\" list, please see Your Choices.\nTelephone Numbers\nWe do not collect telephone numbers without the App or Site user voluntarily providing us with this information. We will periodically use your telephone information to contact you regarding service, sales, support, and marketing purposes. If you do not wish to receive calls from us in the future, please read Your Choices below. From time to time, we share your telephone number with other organizations and companies whose products or services we think you may find interesting. If you would like to be included in our \"do not share\" list, please read Your Choices below.\nAggregate Data\nOkkami may collect information about the use of the App and Site, such as the types of services used and how many users we receive daily. Other than for the tracking purposes identified above, this information is collected in aggregate form, without identifying any user individually. Okkami may use this aggregate, non-identifying statistical data for statistical analysis, marketing or similar promotional purposes.\n\nInformation Sharing\nWe may share the information we collect about you through our services: With providers to enable them to provide the Services you request. For example, we share your name, photo (if you provide one), average User rating given by providers, and pickup and/or drop-off locations with providers;\nWith third parties to provide you a service you requested through a partnership or promotional offering made by a third party or us;\nWith the general public if you submit content in a public forum, such as blog comments, social media posts, or other features of our Services that are viewable by the general public;\nWith third parties with whom you choose to let us share information, for example other Apps or websites that integrate with our API or Services, or those with an API or Service with which we integrate;\nWith Okkami subsidiaries and affiliated entities that provide services or conduct data processing on our behalf, or for data centralization and / or logistics purposes;\nWith vendors, consultants, marketing partners, and other service providers who need access to such information to carry out work on our behalf;\nIn response to a request for information by a competent authority if we believe disclosure is in accordance with, or is otherwise required by, any Applicable law, regulation, or legal process;\nWith law enforcement officials, government authorities, or other third parties if we believe your actions are inconsistent with our User agreements, Terms of Service, or policies, or to protect the rights, property, or safety of Okkami or others;\nIn connection with, or during negotiations of, any merger, sale of company assets, consolidation or restructuring, financing, or acquisition of all or a portion of our business by or into another company;\nIf we otherwise notify you and you consent to the sharing; and In an aggregated and/or anonymized form which cannot reasonably be used to identify you.\n\nSocial Media\nThe Services may integrate with social sharing Media and other related tools which let you share actions you take on our Services with other Apps, sites, or media, and vice versa. Your use of such features enables the sharing of information with your friends or the public, depending on the settings you establish with the social sharing service. Please refer to the privacy policies of those social sharing services for more information about how they handle the data you provide to or share through them.\n\nInternational Transmission\nWhen you submit personal information to Okkami through the App and/or Site, you understand and agree that this information may be transmitted across national boundaries and may be stored and processed in any of the countries in which Okkami and its affiliates and subsidiaries maintain offices, including without limitation, the United States. You also acknowledge that in certain countries or with respect to certain activities, the collection, transferring, storage and processing of your information may be undertaken by trusted vendors of Okkami in connection with the processing and/or fulfillment of transactions and/or orders for products or services. Such vendors are bound by data protection laws meeting the European Commission’s Directive on Data Protection or by contract to not use your personal information for their own purposes or provide it to any third parties except in connection with providing products or services you request or as you may opt-in. One instance where this could occur is in conjunction with framed pages in which the URL for the pages is not visible and the pages are being hosted by a vendor of Okkami.\n\nService providers\nOkkami may have established relationships with various service providers whose services are available to you from the App and Site or from Linked Sites. Typically, these providers offer services or products that Okkami customers might find useful, such as those that can be used in conjunction with Okkami products and services. To use those services, you may be required to provide personal information to the providers. Unless expressly provided to the contrary, personal information that you provide while you are visiting a provider’s website will be subject to the privacy policy posted on such site and personal information that you provide while on this Site in conjunction with a provider’s service will be subject to this Privacy Policy. You should be aware that our agreements with these service providers often provide that they will share with Okkami personal information collected from you. In such instances, Okkami may use this information in a manner consistent with this Privacy Policy.\n\nMobile Operating System Permissions\nMost mobile systems (iOS, Android, etc.) have defined certain types of device data that Apps cannot access without your consent. And these platforms have different permission systems for obtaining your consent. The iOS platform will alert you the first time the Okkami App wants permission to access certain types of data and will let you consent (or not consent) to that request. Android devices will notify you of the permissions that the Okkami App seeks before you first use the App, and your use of the App constitutes your consent.\n\nConsent\nBy voluntarily providing us with your name, e-mail address, postal address (snail mail), telephone number, billing address, and credit card number, you consent to our use of such information to provide that service or product to you and for the purposes described in this Privacy Policy.  We may allow others to provide audience measurement and analytics services for us, to serve advertisements on our behalf across the Internet, and to track and report on the performance of those advertisements. These entities may use cookies, web beacons, SDKs, and other technologies to identify your device when you visit our site and use our Services, as well as when you visit other online sites and services.\n\nInformation Disclosure\nWe do not sell, trade, or rent your personal information to others. We may choose to do so in the future with trustworthy third parties, but you can instruct us not to by reading Your Choices below. There are other instances in which Okkami may divulge your personal information. Okkami may provide your personal information if necessary, in Okkami’s good faith judgment, to comply with laws or regulations of a governmental or regulatory body or in response to a valid subpoena, warrant or order or to protect the rights of Okkami or others. If Okkami goes through a business transition, such as a merger, acquisition by another company, or sale of all or a portion of its assets, we reserve the right to transfer your personal information, which will likely be among the assets transferred. You will be notified via prominent notice on our Site for 30 days of any such change in ownership or control of your personal information.\n\nYour Choices\nOkkami practices opt-in permission marketing. The Site and any email sent to you will enable you to opt-out of receiving future communications from us. To opt-out of receiving such communications or to be included in our “do not share” list, contact us at info@Okkami.com or by following the unsubscribe directions in emails sent to you.  California law permits residents of California to request certain details about how their information is shared with third parties for direct marketing purposes. Okkami does not share your personally identifiable information with third parties for the third parties’ direct marketing purposes unless you provide us with consent to do so\n\nUpdating Your Personal Information\nUpon request, Okkami will provide you with access to your personal information that we have on record. You may correct your account information at any time by logging into your online or in-App account. If you wish to cancel your account, please email us at info@Okkami.com. Please note that in some cases we may retain certain information about you as required by law, or for legitimate business purposes to the extent permitted by law. For instance, if you have a standing credit or debt on your account, or if we believe you have committed fraud or violated our Terms of Use (“TOU”), we may seek to resolve the issue before deleting your information.  Users can request their personal information at any time by contacting us. We will make every effort to ensure your right to privacy by reviewing, qualifying and validating Visitor Information Requests before disseminating such information.\n",
  "TERMS_OF_SERVICE_DETAIL_3": "Privacy-Related Inquiries and Complaints\nOkkami takes its users’ privacy concerns seriously. If you believe that Okkami has not complied with this Privacy Policy with respect to your personal information or you have other related inquiries or concerns, you may write to us at the address above. In your letter, please describe in as much detail as possible the nature of your inquiry or the ways in which you believe the Privacy Policy has not been complied with. We will investigate your inquiry or complaint promptly. If you do not receive an acknowledgment of your inquiry or complaint or your inquiry or complaint is not satisfactorily addressed, you should then contact the Okkami legal department, who will serve as a liaison with this Site to resolve your concerns. Please note that if you provide Okkami with inconsistent privacy preferences (for example, by indicating on one occasion that third parties may contact you with marketing offers and indicating on another occasion that they may not), Okkami cannot guarantee that your most recent privacy preference will be honored.\n\nOther websites and Your Privacy Concerns\nOur Site contains links to other websites that are not owned or operated by Okkami. We are not responsible for the privacy practices or the content of such websites. For more information on your privacy rights with regard to those sites, please refer to the privacy policies of each website that you visit.\n\nSecurity: Online and Offline\nWe may have licensed the industry-standard Secure Sockets Layer (SSL) technology that permits encryption of potentially sensitive information such as your credit card number. This will make your information unusable in the event of unauthorized third-party interception. Additionally, we have Appropriate security measures in place at our physical facilities to protect against the loss, misuse or alteration of your personal information.\n\nPolicy Changes\nBy using our Site, you consent to the collection and use of your non-personal information by Okkami. From time to time, we may use your non-personal information for new, unanticipated uses not previously disclosed in our Privacy Policy. Okkami reserves the right to change this Privacy Policy at any time without any prior notice. All Privacy Policy changes and updates will be promptly posted on our Site.\n\nFeedback\nOur continuing goal is to protect and safeguard your right to privacy. As such, we Appreciate all feedback that helps us improve our Privacy Policy. Please share with us your thoughts, comments, and suggestions, at info@Okkami.com.\n\nLast Revised: June 5, 2016 (v 10)\n\n",


  "CHANNEL_FILTER":"Channel Filter",

  "PAIRING_INVALID_NAME":"Invalid name or password",

  "PAIRED_SUCCESS_PUSH_TITLE": "Pairing Success",
  "PAIRED_SUCCESS_PUSH_DESC": "You are now paired with <hname> <rnumber>",
  "UNPAIRED_SUCCESS_PUSH_TITLE": "Device Successfully Disconnected",
  "UNPAIRED_SUCCESS_PUSH_DESC": "You have been disconnected from room <rnumber> <hname>",
  "PAIRING_EMPTY_ERROR":"Invalid pairing code or access token",
  "PAIRING_ALREADY_PAIRED_ERROR":"You are currently paired to another room/brand",
  "SELECT_DATE": "Select Date",

  "PLEASE_CHECK_YOUR_EMAIL": "Please Check Your Email",
  "UPGRADE_TEXT": "Your current app version is lower than the minimum version. Please upgrade to continue",
  "CONFIRM_UPGRADE":"Upgrade",
  "GO_TO_STORE":"Go To Store",

  "DEVICE_OFFLINE":"Device Offline",
  "DEVICE_OFFLINE_DETAIL":"Service is currently offline please try again later.",

  "ERROR_UNVERIFIED_PAIR":"You need to confirm your email and re-login before pairing to the room",
  "ERROR_ANONYMOUS_PAIR":"You need to log in before pairing to the room",
  "ERROR_ANONYMOUS_FIXED_DEVICE_PAIR":"This device is currently not checked-in, please contact the Front desk for assistance.\n\nHave a wonderful stay!",

  "DEVICE": "Device",
  "SELECT_DEVICE": "Please select which in-room device you want to control.",
  "VIEW_BASKET" :"View Basket",
  "PLACE_ORDER" :"Place Order",
  "YOUR_ORDER": "Your Order",
  "EDIT": "Edit",
  "ADD_MORE_ORDER": "Add more order",
  "COMMENT_OPTIONAL": "Comment (Optional)",
  "NOTE_ORDER": "Note: Consuming raw or undercooked meats,\npoultry, seafood, shellfish, eggs, or unpasturized\nmilk may increase your risk of foodborne illness.",
  "SUBTOTAL": "Subtotal",
  "TAXES": "Taxes / VAT",
  "SERVICE_CHARGE": "Service Charge",
  "PROCESSING_CHARGE": "Processing Charge",
  "DELETE": "Delete",
  "DONE": "Done",
  "ADD_A_NOTE": "Add a note (extra sauce etc.)",
  "ADDITIONAL_COMMENT": "Additional Comments",
  "CHOOSE_ADDONS": "Choose Addons",
  "ADD": "Add",
  "TO_BASKET": "TO BASKET",
  "CHOOSE_YOUR_BREAD": "Choose your bread",
  "REQUIRED": "Required",
  "BASKET_ROOM_TITLE": "BASKET | ROOM ",
  "PREVIOUS_MENU": "Previous Menu",
  "CONFIRM_ORDER": "Confirm Order",
  "BILL_AMOUNT_POS": "The following amount will be added to room ",
  "BILL_AMOUNT_POS_2": " once you confirm the order.",
  "BILL_AMOUNT_NON_POS": "The following amount will be added to room ",
  "BILL_AMOUNT_NON_POS_2": " once the order has been completed.",
  "ORDER_FINISH": "We've started to prepare your order",
  "USE_BELL_ICON": "Use this icon to view pending orders and request",
  "THANK_YOU": "Thank You",
  "ERROR": "Error",
  "SHOPPING_CARD_ERROR": "The operation couldn't be completed, please try again",

  "ROOM_TYPE": "Room Type",
  "ROOM_NUMBER": "Room Number",
  "SETUP_IN_ROOM_DEVICE": "Setup In-Room Device",
  "SETUP_IN_ROOM_DEVICE_NOT_REGIS": "This device is not registered to any room. Please choose room type and room number and then click 'NEXT' to continue.",
  "DELETE_THIS_DEVICE": "Delete this device from room ",
  "NEXT": "NEXT",
  "SETUP_IN_ROOM_DEVICE_REGIS": "This device is registered to room ",
  "SETUP_IN_ROOM_DEVICE_REGIS_2": "Please choose room type and room number and then click 'NEXT' to continue.",
  "THIS_DEVICE_ALREADY": "This device is already added to this room.",

  "WELCOME_START_SETTING": "Welcome, start setting up your device for",
  "PLEASE_CHOOSE_ROOM_NUMBER": "Please choose room number and then click “NEXT” to continue",
  "CONFIRMATION": "Confirmation",
  "YOU_ARE_ABOUT_TO_ADD": "You're about to add a new device at",
  "PLEASE_CONFIRM_THE_DETAIL": "Please confirm the details below are correct.",
  "THANK_YOU_FOR_REGIS": "Thank you for registering this device.",
  "IT_NOW_READY": "It's now ready for guest to use.",
  "FILL_ROOM_NUMBER": "Please key ROOM NUMBER",
  "THERE_IS_A_DEVICE_ALREADY": "There is a device already registered to",
  "MANAGE_DEVICES": "Manage Devices",
  "ADD_NEW_DEVICE": "Add new device",
  "PLEASE_CHOOSE_WHAT_TO": "Please choose what you would like to do next.",
  "CURRENT_DEVICE_ON_THIS_ROOM": "Current device on this room",
  "BUTTON_REPLACE": "Replace",
  "YOU_ARE_ABOUT_TO_MODIFY": "You're about to modify ",
  "CURRENT_LOCATION": "Current location",
  "NEW_LOCATION": "New location",
  "TO_MOVE_THIS_DEVICE": "To move this device select manage devices",
  "MOVE": "move",
  "THIS_DEVICE": "This device.",
  "SELECT_ROOM": "Select Room",

  "PLEASE_PAIR_TO_THE_ROOM": "Please pair to the room to place an order.",
  "THIS_ITEM_IS_FOR_DISPLAY": "This item is for display only",

  "ENTER_THE_ROOM_NUMBER": "Enter the new room number that you would like to move the device to",
  "PLEASE_SELECT_THE_DEVICE": "Please select the device you would like to replace",
  "THIS_DEVICE_IS_ALREADY": "This device is already registered to",
  "YOU_HAVE_JUST_REQUEST":"You have just requested",
  "FOR_ROOM":"for room",
  "PLEASE_PAIR_TO_THE_ROOM_TO_SEND_REQUEST": "Please pair to the room to send a request",
  "SORRY": "Sorry",
  "UNABLE_TO_GET_ITEM_PRICE": "Unable to get item price, please try again",

  "PASSWORD_CONTAIN_LOWER_CASE":"Password should contain a lowercase letter",
  "PASSWORD_CONTAIN_UPPER_CASE":"Password should contain an uppercase letter",
  "PASSWORD_CONTAIN_NUMBER":"Password should contain a number",
  "PASSWORD_CHARACTER":"Password should be at least 8 characters",
  "PASSWORD_HINT":"Password Hint",
  "PASSWORD_RULES":"Password Rules",
  "PLEASE_FILL_REQUIRED_VALUE":"Please Fill The Required Value",
  "LOBBY_HEADER":"About OKKAMI",


  "PLEASE_CONFIRM_REQUESTED_RESERVATION":"Please confirm your requested reservation bellow:",
  "APPOINTMENT_HELD_FOR":"appointment held for",
  "PLEASE_ARRIVE_AT_SPA":"Please arrive at the Spa Lobby 15 minutes prior to your scheduled appointment to enable us to personalize your experience.",
  "KINDLY_BE_INFORMED":"Kindly be informed that we require 5 hours for individual treatments and 24 hours for packages notice of cancellation within 2 hours to avoid 50% charge. Cancellation within 2 hours will incur 100% charge. If there is any change of the treatment required, please allow us 1 hours in advance for necessary preparation.",
  "COMPLETE_BOOKING":"Complete Booking",
  "YOU_HAVE_SCHEDULED":"You've scheduled your Appointment",
  "SOMETHING_WENT_WRONG":"Something went wrong,\nplease check your internet connection and try again",
  "EVENTS":"Events",
  "WHEN":"When",
  "START":"Start",
  "END":"End",

  "FIND_APPOINTMENT":"Find Appointment",
  "PLEASE_PAIR_BOOK_TREATMENT":"Please Pair to the room to book a treatment",
  "TIME_SLOT_NOT_AVAILABLE":"Time Slot Not Available",
  "TIME_SLOT_NOT_AVAILABLE_TEXT":"Sorry your selected time slot is no longer available.",
  "FIND_NEW_APPOINTMENT_TEXT":"Press the button below to find a new appointment.",
  "FIND_NEW_APPOINTMENT":"Find new appointment",
  "SOMETHING_WRONG":"Something went wrong, please try again.",
  "CONFIRM_APPOINTMENT":"Confirm Appointment",
  "SESSION_TIMEOUT": "Session Timeout",
  "SESSION_TIMEOUT_DETAIL":"We are only able to hold your appointment selections for",
  "SESSION_TIMEOUT_MINUTES_TEXT": "minutes.",
  "CHANGE_BOOKING": "Change Booking",
  "NO_AVAILABLE_TIME_SLOT": "There is no available time slot for the selected date/time.",
  "ABOUT": "About",
  "APP_NAME" :"App Name",
  "APP_VERSION": "App Version",
  "APP_BRAND" :"App Brand",
  "DEVICE_NAME":"Device Name",
  "DEVICE_UPTIME":"Device Uptime",
  "WIFI_SSID":"WIFI SSID",
  "WIFI_SIGNAL":"WIFI Signal",
  "HUB_STATUS":"Hub Status",
  "LAST_CONNECTION":"Last Successful Connection",
  "INTERNET_CONNECTIVITY":"Internet Connectivity",
  "OKKAMI_SERVER":"OKKAMI Server",
  "MANAGEMENT_SERVER":"Management Server",
  "PUSH_NOTIF_STATUS":"Push Notif Status",
  "PAIRING_STATUS":"Pairing Status",
  "CHECKIN_STATUS":"Checkin Status",
  "BATTERY_STATUS":"Battery Status",
  "LATITUDE":"Latitude",
  "LONGITUDE":"Longitude",
  "HUB_URL":"HUB URL",
  "ADVANCED":"Advanced",
  "UNLOCK":"Unlock",
  "DEVICE_UID":"Device UID",
  "WIFI_IP":"WIFI IP",
  "WIFI_MAC":"WIFI MAC",

  "INVALID_PASSCODE": "Invalid Passcode",
  "MANAGE_DEVICE":"Manage Device",

  "ERROR_REQUEST":"Something went wrong with your request",
  "NO_APPOINTMENTS_AVAILABLE":"No Appointments available on",
  "SEE_APPOINTMENTS_ON":"See appointments on",
  "GO_BACK":"Go Back",
  "LIVE_CHAT":"Live Chat",
  "FULFILLMENT":"Fulfillment Request",
  "SELECT_LANGUAGE" : "Select Language",

  "SELECT_AN_ITEM": "Select an Item",

  "MOBILE_KEY": "Mobile Key",
  "CREATING_MOBILE_KEY": "Creating Mobile Key",
  "PLEASE_HANG_TIGHT": "Please hang tight.",
  "YOUR_SECURE_MOBILE_KEY": "your secure mobile key is being created right now",
  "EXPIRED_KEY": "Expired key",
  "CALL_FRONT_DESK": "Call front desk",
  "CLOSE": "Close",
  "WE_ARE_SORRY_WE_ARE_UNABLE": "We are sorry, we are unable to create your key.",
  "PLEASE_CALL_FRONT_DESK": "Please call front desk for assistance.",
  "YOUR_MOBILE_KEY_HAS_EXPIRED": "Your mobile key has expired",
  "PLEASE_CONTACT_THE_FRONT_DESK": "Please contact the front desk if you want to extend the use of your mobile key.",
  "PRESS_BUTTON_BELOW": "Press button below to start.",
  "NOW_HOLD_YOUR_PHONE": "Now hold your phone against door lock",

  "CHECK_EMAIL_VERIFICATION": "Please check your email for account verification instructions.",

  "DONT_REMEMBER" : "Don't remember your password ? ",
  "CLICK_HERE" : "Click here to reset",
  "PLEASE_SELECT_ITEM":"Please select an item first",

  "WOULD_YOU_LIKE_TO_RECEIVE_OFFER": "Would you like to receive offers from ",
  "WOULD_YOU_LIKE_TO_SUBSCRIBE": "Would you like to subscribe to our newsletter?",
  "NO_RADIO_STATIONS": "There are no available radio stations",
  "HOMETOWN" : "Hometown",
  "ADDITIONAL_INFORMATION" : "ADDITIONAL INFORMATION",
  "BRAND_SUBSCRIPTION" : "Brand Subscription",
  "RECEIVE_OFFERS" : "Receive Offers",
  "RECEIVE_NEWS" : "Receive NewsLetter",
  "VERIFY_NOW" : "Verify Now",
  "ADD_NOW" : "Add Now",
  "BASKET" : "Basket",

  "NEED_PHONE_NUMBER": "To use selected features we need verify your phone number.",
  "NEED_CODE": "We have sent a verification code to your number enter it below.",
  "OTP_SUCCESS_PROFILE_UPDATED": "Your profile have been updated.",
  "PHONE_NUMBER": "phone number",
  "CODE_TXT": "code",
  "VERIFY_TXT": "verify",
  "WE_UNABLE_PROCESS": "We was unable to process your request.",
  "TYR_AGAIN_TXT": "Try Again",
  "RESEND_CODE": "Press this button to resend code",
  "PHONE_NUMBER_INVALID_TXT": "Phone number is invalid.",
  "CURRENT_HOMETOWN" : "Current Hometown",
  "HISTORY":"History",
  "ACCOUNT_INFO":"Account Info",
  "TEMPERATURE": "Temperature",
  "TV_REMOTE":"Tv Remote",
  "LIGHTING":"Lighting",
  "ROOM_CONTROLS":"Room Controls",
  "PLEASE_VERIFY_PLACE_ORDER":"Please verify your email and log in again to place an order",
  "PAIRED_ACCOUNTS": "PAIRED ACCOUNTS",
  "THERE_IS_NO_PERSON": "There is no other person in the room",
  "NO_ORDER":"You currently do not have any order or request",
  "QUICK_HELP":"Quick Help",
  "TAP_ANYWHERE":"Tap anywhere to continue",
  "SWIPE_UP_OR_DOWN":"Swipe up or down to see menu list",
  "TAP_BOOK_ICON":"Tap book icon for shortcut menu",
  "OUT_OF_STOCK":"Out of stock",
  "EMAIL_VERIFICATION":"Email Verification",
  "PLEASE_ENTER_THREE": "Please enter 3 or more characters",
  "NO_RESULTS_FOUND": "No results found",
  "SOMETHING_WENT_WRONG_ONE": "Something went wrong, please check your",
  "SOMETHING_WENT_WRONG_TWO": "internet connection and try again",

  "IF_VERIFIED_EMAIL": "if you already verified your email, ",
  "IF_VERIFIED_EMAIL_CLICK_HERE": "click here.",

  "PROPERTY_ID": "Property ID",
  "PROPERTY_SECRET": "Property Secret",

  "TAB_TO_VIEW_SERVICES": "TAP SCREEN TO VIEW SERVICES",
  "LOW_BATTERY": "LOW BATTERY",
  "PUT_ME_BACK": "PUT ME BACK",
  "NOT_CHARGING": "NOT CHARGING",
  "CHARGING": "CHARGING",
  "BRIGHTNESS": "BRIGHTNESS",

  "YOU_HAVE_NOT_VERIFIED": "You have not verified your email yet. Please check your email for instruction.",

  "HELLO_TRAVELLER": "Hello Traveller",
  "PLEASE_ENTER_ADMIN_PASSWORD": "Please enter admin password",
  "INVALID_ID_OR_SECRET": "Invalid id/secret",
  "LOADING_HOTEL":"Loading Hotel Services",

  "SLIDE_THE_DIAL": "Slide the dial or click the arrows to change the room temperature",
  "COOLING_SET_TO": "Cooling set to",
  "ITEM_NOT_AVAILABLE":"This item is no longer available, please remove",
  "PLEASE_FILL_OUT_REQUIRED": "Please fill out required fields",
  "MDM_DEVICE_ID": "MDM Device ID",

  "THIS_DEVICE_LOST": "This device is lost.",
  "THIS_DEVICE_ASSOCIATED": "This device is associated with ",
  "FOR_SECURITY_REASON_PLS_CONTACT": "For security reason, you need to enter passcode to activate the device.",
  "PLEASE_CALL_ASSISTANCE": "Please call ",
  "ANY_ASSISTANCE": "for any assistance.",
  "SHOPPING":"Shopping",
  "BUY_NOW":"Buy Now",
  "DISMISS":"Dismiss",
  "NEW_MESSAGE_ALERT":"New Message Alert",

  "ACCOUNT_VERIFICATION": "ACCOUNT VERIFICATION",
  "PLEASE_CHECK": "Please check ",
  "FOR_VERIFICATION_INSTRUCTION": "for account verification instructions \n or ",
  "ENTER_DIFFERENT_EMAIL": "to enter a different email address.",
  "CHECK_SPAM_IF_NOT_GET_EMAIL": "If you did not receive the email,\nplease check your spam / junk folder.",
  "ONCE_VERIFIED": "Once you've verified your email, ",
  "ITEM_AVAILABLE": "This item is only available ",

  "NEW_PROMO1_HEADER":"PRE-ARRIVAL REQUEST",
  "NEW_PROMO1_TEXT":"Whether it’s requesting a pickup at the airport, ordering food & beverage for the room, or surprising someone special, let the hotel know how to pre-prepare your experience.",
  "NEW_PROMO2_HEADER":"LIVE CHAT",
  "NEW_PROMO2_TEXT":"Communicate with hotels, in your language, on your terms. Overcome any language barriers that may arise with the live chat translation feature.",
  "NEW_PROMO3_HEADER":"FIND SPECIAL PROMOTIONS",
  "NEW_PROMO3_TEXT":"Get the latest special packages, discounts, and other offers from the hotels before you arrive.",

  "NEW_PASSWORD": "New password",
  "CONFIRM_NEW_PASSWORD": "Confirm new password",
  "TO_UPDATE_ENTER_IN_A_NEW_PASSWORD": "To update enter in a new password",

  "PORTRAIT": "Portrait",
  "LANDSCAPE": "Landscape",
  "ALERT_LANDSCAPE": "This action will store the landscape settings and exit the app. You must start the app again to see the changes.",
  "ALERT_PORTRAIT": "This action will store the portrait settings and exit the app. You must start the app again to see the changes.",
  "SCREEN_ORIENTATION": "Screen Orientation",

  "YOU_HAVE_ALREADY_MADE": "You've already made a similar request.",
  "PLEASE_ALLOW_US_TIME_TO_COMPLETE": "Please allow us time to complete your first request before you submit a new request."

}
